# Parameter Type Id Steel Elem Profile Length Property

Source: https://www.revitapidocs.com/2026/661c43bb-fef3-66a0-59a5-a0ddfc1fbefe.htm

---

| Parameter Type Id Steel Elem Profile Length Property |
| --- |

"System Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId SteelElemProfileLength { get; }
```

```
Public Shared ReadOnly Property SteelElemProfileLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ SteelElemProfileLength {
	ForgeTypeId^ get ();
}
```

```
static member SteelElemProfileLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace